app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `admin`
SELECT COUNT(*) AS `numrows`
FROM `guru`
SELECT COUNT(*) AS `numrows`
FROM `murid`
SELECT COUNT(*) AS `numrows`
FROM `walimurid`
SELECT COUNT(*) AS `numrows`
FROM `ibadah`
---
    public function index()
    {

        $data = [
            'title' => 'Admin Dashboard',
            'count_admin' => $this->adminModel->countAllResults(),
            'count_guru' => $this->guruModel->countAllResults(),
            'count_murid' => $this->muridModel->countAllResults(),
            'count_walimurid' => $this->walimuridModel->countAllResults(),
            'count_ibadah' => $this->ibadahModel->countAllResults(),

INSERT INTO `walimurid` (`username_walimurid`, `password_walimurid`, `email_walimurid`, `nama_walimurid`, `nisn_murid`, `jenis_kelamin`, `foto_profile`) VALUES ('wdsadwasd', '$2y$10$CH4TAGOUYCWLvQvhP.HIl.ahUbay4y90Fk2lY3ABWSEEnpCj6niyK', 'shitatmiyu@gmail.com', 'Ayaka', '11111111', 'Perempuan', '1680199870_9f55574107a34493d9da.jpg')
---

            $password = password_hash($this->request->getVar('password_walimurid'), PASSWORD_DEFAULT);

            $this->walimuridModel->save([
                'username_walimurid' => $this->request->getVar('username_walimurid'),
                'password_walimurid' => $password,
                'email_walimurid' => $this->request->getVar('email_walimurid'),
                'nama_walimurid' => $this->request->getVar('nama_walimurid'),
                'nisn_murid' => $this->request->getVar('nisn_murid'),
                'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
                'foto_profile' => $namaFoto,
            ]);