app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `username_admin` = 'admin01'
 LIMIT 1
SELECT *
FROM `guru`
WHERE `username_guru` = 'admin01'
 LIMIT 1
SELECT *
FROM `murid`
WHERE `username_murid` = 'admin01'
 LIMIT 1
SELECT *
FROM `walimurid`
WHERE `username_walimurid` = 'admin01'
 LIMIT 1
---
    public function attempt()
    {
        $adminModel = new AdminModel();
        $guruModel = new GuruModel();
        $muridModel = new MuridModel();
        $walimuridModel = new WalimuridModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $adminModel->where('username_admin', $username)->first();
        $guru = $guruModel->where('username_guru', $username)->first();
        $murid = $muridModel->where('username_murid', $username)->first();
        $walimurid = $walimuridModel->where('username_walimurid', $username)->first();