app/Models/AbsenibadahholdModel.php

SELECT *
FROM `absenibadahhold`
WHERE `nisn_murid` = '987654321'
---
    public function getAbsenHoldwm($id_absenhold = false)
    {
        $session = \Config\Services::session();
        $nisn = $session->get('students_id');

        if ($id_absenhold == false) {
          return $this->where('nisn_murid', $nisn)
                      ->findAll();