app/Models/AbsenibadahModel.php

SELECT *
FROM `absenibadah`
WHERE `nisn_murid` = '123456789'
---
    public function getAbsen($nisn_murid = false)
    {
        $uri = service('uri');
        $nisn = $uri->getSegment(2);

        if ($nisn_murid == false) {
            return $this->where('nisn_murid', $nisn)
            ->findAll();