app/Models/AdminModel.php

    public function getAdmin($id_admin = false)
  {
      if ($id_admin == false) {
        return $this->findAll();
      }
      return $this->where (['id_admin' => $id_admin])->first();
---
SELECT *
FROM `admin`
WHERE `id_admin` = '1'
 LIMIT 1