app/Models/GuruModel.php

SELECT *
FROM `guru`
---
    public function getGuru($id_guru = false)
    {
        if ($id_guru == false) {
          return $this->findAll();