app/Models/IbadahModel.php

    public function getIbadah($id_ibadah = false)
  {
      if ($id_ibadah == false) {
        return $this->findAll();
      }
      return $this->where (['id_ibadah' => $id_ibadah])->first();
---
SELECT *
FROM `ibadah`
SELECT *
FROM `ibadah`
WHERE `id_ibadah` = '2'
 LIMIT 1