app/Models/MuridModel.php

SELECT *
FROM `murid`
SELECT *
FROM `murid`
WHERE `nisn` = '987654321'
 LIMIT 1
---
    public function getMurid($nisn = false)
    {
        if ($nisn == false) {
          return $this->findAll();
        }
        return $this->where (['nisn' => $nisn])->first();