app/Models/WalimuridModel.php

    public function getWalimurid($id_walimurid = false)
    {
        if ($id_walimurid == false) {
            $builder = $this->db->table($this->table);
            $builder->select('walimurid.*, murid.nama_murid as nama_murid');
            $builder->join('murid', 'murid.nisn = walimurid.nisn_murid');
            return $builder->get()->getResult();
        }
            $builder = $this->db->table('walimurid');
            $builder->select('walimurid.*,murid.username_murid as username_murid,murid.nama_murid as nama_murid');
            $builder->join('murid', 'murid.nisn = walimurid.nisn_murid');
            $builder->where('walimurid.id_walimurid =', $id_walimurid);
            $query = $builder->get();
---
SELECT `walimurid`.*, `murid`.`nama_murid` as `nama_murid`
FROM `walimurid`
JOIN `murid` ON `murid`.`nisn` = `walimurid`.`nisn_murid`
SELECT `walimurid`.*, `murid`.`username_murid` as `username_murid`, `murid`.`nama_murid` as `nama_murid`
FROM `walimurid`
JOIN `murid` ON `murid`.`nisn` = `walimurid`.`nisn_murid`
WHERE `walimurid`.`id_walimurid` = '2'

    public function Hapuswalimurid($id)
    {
        $this->db->disableForeignKeyChecks();
        $query = $this->db->table($this->table)->delete(array('id_walimurid' => $id));
---
DELETE FROM `walimurid`
WHERE `id_walimurid` = '4'